//-----------------------------------------------<< Komenda >>-----------------------------------------------//
//--------------------------------------------------[ bwset ]-------------------------------------------------//
//----------------------------------------------------*------------------------------------------------------//
//----[                                                                                                 ]----//
//----[         |||||             |||||                       ||||||||||       ||||||||||               ]----//
//----[        ||| |||           ||| |||                      |||     ||||     |||     ||||             ]----//
//----[       |||   |||         |||   |||                     |||       |||    |||       |||            ]----//
//----[       ||     ||         ||     ||                     |||       |||    |||       |||            ]----//
//----[      |||     |||       |||     |||                    |||     ||||     |||     ||||             ]----//
//----[      ||       ||       ||       ||     __________     ||||||||||       ||||||||||               ]----//
//----[     |||       |||     |||       |||                   |||    |||       |||                      ]----//
//----[     ||         ||     ||         ||                   |||     ||       |||                      ]----//
//----[    |||         |||   |||         |||                  |||     |||      |||                      ]----//
//----[    ||           ||   ||           ||                  |||      ||      |||                      ]----//
//----[   |||           ||| |||           |||                 |||      |||     |||                      ]----//
//----[  |||             |||||             |||                |||       |||    |||                      ]----//
//----[                                                                                                 ]----//
//----------------------------------------------------*------------------------------------------------------//

// Opis:
/*
	
*/


// Notatki skryptera:
/*
	
*/

YCMD:bwset(playerid, params[], help)
{
    if(!IsAHeadAdmin(playerid) && !IsAScripter(playerid)) return noAccessMessage(playerid);
    new togbw;
    if(sscanf(params, "d", togbw)) return sendTipMessage(playerid, "Użyj: /bwset [0 - off, 1 - on]");
    if(togbw == BW) return sendErrorMessage(playerid, sprintf("BW jest już %s!", (BW) ? ("włączone") : ("wyłączone")));
    BW = togbw;
    SendClientMessage(playerid, COLOR_NEWS, sprintf("%s BW.", (BW) ? ("Włączyłeś") : ("Wyłączyłeś")));
    SendClientMessageToAll(COLOR_LIGHTBLUE, sprintf("Admin %s %s automatyczne BW!", GetNickEx(playerid), (BW) ? ("włączył") : ("wyłączył")));
    return 1;
}